ZAG-UA/ESPEasy-mega-20230409-ESP32-C3-S3/src/src/Helpers/Hardware.cpp
#include "../Helpers/Hardware.h"

#include "../Commands/GPIO.h"
#include "../CustomBuild/ESPEasyLimits.h"
#include "../DataTypes/SPI_options.h"
#include "../ESPEasyCore/ESPEasyGPIO.h"
#include "../ESPEasyCore/ESPEasy_Log.h"

#include "../Globals/Device.h"
#include "../Globals/ESPEasyWiFiEvent.h"
#include "../Globals/ExtraTaskSettings.h"
#include "../Globals/Settings.h"
#include "../Globals/Statistics.h"
#include "../Globals/GlobalMapPortStatus.h"

#include "../Helpers/ESPEasy_FactoryDefault.h"
#include "../Helpers/ESPEasy_Storage.h"
#include "../Helpers/Misc.h"
#include "../Helpers/PortStatus.h"
#include "../Helpers/StringConverter.h"


#if defined(ESP8266)
  #include <ESP8266WiFi.h>
#endif // if defined(ESP8266)
#if defined(ESP32)
  #include <WiFi.h>
#endif // if defined(ESP32)

// #include "../../ESPEasy-Globals.h"

#ifdef ESP32
  #include <soc/soc.h>
  #include <soc/efuse_reg.h>
  #include <soc/spi_reg.h>
  #include <soc/rtc.h>
  #if ESP_IDF_VERSION_MAJOR > 3      // IDF 4+
    #if CONFIG_IDF_TARGET_ESP32S2   // ESP32-S2
      #include <esp32s2/rom/spi_flash.h>
      #include <esp32s2/spiram.h>
    #elif CONFIG_IDF_TARGET_ESP32C3 // ESP32-C3
      #include <esp32c3/rom/spi_flash.h>
    #elif CONFIG_IDF_TARGET_ESP32S3   // ESP32-S3
      #include <esp32s3/rom/spi_flash.h>
      #include <esp32s3/spiram.h>
    #elif CONFIG_IDF_TARGET_ESP32   // ESP32/PICO-D4
      #include <esp32/rom/spi_flash.h>
      #include <esp32/spiram.h>
    #else // if CONFIG_IDF_TARGET_ESP32S2
      #error Target CONFIG_IDF_TARGET is not supported
    #endif // if CONFIG_IDF_TARGET_ESP32S2
  #else // ESP32 Before IDF 4.0
    #include <rom/spi_flash.h>
  #endif    // if ESP_IDF_VERSION_MAJOR > 3
#endif       // ifdef ESP32


#if FEATURE_SD
  #include <SD.h>
#endif // if FEATURE_SD

#include <SPI.h>
#include <Wire.h>

#define GPIO_PLUGIN_ID  1

  bool hasPullUp, hasPullDown;

#ifdef ESP32
  uint32_t lastI2CClockSpeed = 100000UL;
#endif // ifdef ESP32
#ifdef ESP8266
  static uint32_t lastI2CClockSpeed = 100000;
#endif // ifdef ESP8266

static int8_t last_sda = Settings.Pin_i2c_sda;
static int8_t last_scl = Settings.Pin_i2c_scl;

/********************************************************************************************\
 * Initialize specific hardware settings (only global ones, others are set through devices)
 \*********************************************************************************************/
void setPinBootState(int gpio)
{
  const bool serialPinConflict = (Settings.UseSerial && 
#ifdef ESP32
    ((gpio == TX_GPIO) || (gpio == RX_GPIO))
#else // ifdef ESP32
    ((gpio == 1) || (gpio == 3))
#endif // ifdef ESP32
  );
  if (!serialPinConflict) {
    const uint32_t key = createKey(1, gpio);
#ifdef ESP32
    checkAndClearPWM(key);
#endif // ifdef ESP32
    if (getGpioPullResistor(gpio, hasPullUp, hasPullDown)) {
      PinBootState bootState = Settings.getPinBootState(gpio);
#if FEATURE_ETHERNET
      if (Settings.ETH_Pin_power == gpio)
      {
        if (loglevelActiveFor(LOG_LEVEL_INFO)) {
          String log = F("ETH  : Reset ETH module on pin ");
          log += Settings.ETH_Pin_power;
          addLog(LOG_LEVEL_INFO, log);
        }
        bootState = PinBootState::Output_low;
      }
#endif // if FEATURE_ETHERNET
      if (bootState != PinBootState::Default_state) {
#ifdef ESP32
        gpio_reset_pin(static_cast<gpio_num_t>(gpio));
#endif
        switch (bootState)
        {
          case PinBootState::Default_state:
            // At startup, pins are configured as INPUT
            break;
          case PinBootState::Output_low:
            createAndSetPortStatus_Mode_State(key, PIN_MODE_OUTPUT, 0);
            GPIO_Write(GPIO_PLUGIN_ID, gpio, LOW, PIN_MODE_OUTPUT);
            // setPinState(1, gpio, PIN_MODE_OUTPUT, LOW);
            break;
          case PinBootState::Output_high:
            createAndSetPortStatus_Mode_State(key, PIN_MODE_OUTPUT, 0);
            GPIO_Write(GPIO_PLUGIN_ID, gpio, HIGH, PIN_MODE_OUTPUT);
            // setPinState(1, gpio, PIN_MODE_OUTPUT, HIGH);
            break;
          case PinBootState::Input_pullup:
            if (hasPullUp) {
              createAndSetPortStatus_Mode_State(key, PIN_MODE_INPUT_PULLUP, 0);
              pinMode(gpio, INPUT_PULLUP);
            }
            break;
          case PinBootState::Input_pulldown:
            if (hasPullDown) {
              createAndSetPortStatus_Mode_State(key, PIN_MODE_INPUT_PULLDOWN, 0);
#ifdef ESP8266
              if (gpio == 16) {
                pinMode(gpio, INPUT_PULLDOWN_16);
              }
#endif // ifdef ESP8266
#ifdef ESP32
              pinMode(gpio, INPUT_PULLDOWN);
#endif // ifdef ESP32
            }
            break;
          case PinBootState::Input:
            createAndSetPortStatus_Mode_State(key, PIN_MODE_INPUT, 0);
            pinMode(gpio, INPUT);
            break;
        }
      }
    }
  }
}

void hardwareInit()
{

  for (int gpio = 0; gpio <= MAX_GPIO; ++gpio) {
      setPinBootState(gpio);
  }

  // set GPIO pins state if not set to default
  if (getGpioPullResistor(Settings.Pin_Reset, hasPullUp, hasPullDown)) {
    if (hasPullUp) {
      pinMode(Settings.Pin_Reset, INPUT_PULLUP);
    }
  }

  initI2C();

  #if FEATURE_PLUGIN_PRIORITY
  String dummy;
  PluginCall(PLUGIN_PRIORITY_INIT_ALL, nullptr, dummy);
  #endif // if FEATURE_PLUGIN_PRIORITY

  // SPI Init
  if (Settings.isSPI_valid())
  {
    SPI.setHwCs(false);

    // MFD: for ESP32 enable the SPI on HSPI as the default is VSPI
#ifdef ESP32

    const SPI_Options_e SPI_selection = static_cast<SPI_Options_e>(Settings.InitSPI);

    switch (SPI_selection) {

#ifndef CONFIG_IDF_TARGET_ESP32C3
      case SPI_Options_e::Vspi:
      {
        SPI.begin(VSPI_SCLK, VSPI_MISO, VSPI_MOSI); // VSPI
        break;
      }
#endif // ifndef CONFIG_IDF_TARGET_ESP32C3

      case SPI_Options_e::Hspi:
      {
        SPI.begin(HSPI_SCLK, HSPI_MISO, HSPI_MOSI); // HSPI
        break;
      }
      case SPI_Options_e::UserDefined:
      {
        SPI.begin(Settings.SPI_SCLK_pin, Settings.SPI_MISO_pin, Settings.SPI_MOSI_pin); // User-defined SPI
        break;
      }
      case SPI_Options_e::None:
        break;
    }
#else // ifdef ESP32
    SPI.begin();
#endif // ifdef ESP32
    addLog(LOG_LEVEL_INFO, F("INIT : SPI Init (without CS)"));
  }
  else
  {
    addLog(LOG_LEVEL_INFO, F("INIT : SPI not enabled"));
  }

#if FEATURE_SD

  if (Settings.Pin_sd_cs >= 0)
  {
    if (SD.begin(Settings.Pin_sd_cs))
    {
      addLog(LOG_LEVEL_INFO, F("SD   : Init OK"));
    }
    else
    {
      SD.end();
      addLog(LOG_LEVEL_ERROR, F("SD   : Init failed"));
    }
  }
#endif // if FEATURE_SD
}

void initI2C() {
  // configure hardware pins according to eeprom settings.
  if (!Settings.isI2CEnabled())
  {
    return;
  }
  addLog(LOG_LEVEL_INFO, F("INIT : I2C"));
  I2CSelectHighClockSpeed(); // Set normal clock speed

  if (Settings.WireClockStretchLimit)
  {
    if (loglevelActiveFor(LOG_LEVEL_INFO)) {
      String log = F("INIT : I2C custom clockstretchlimit:");
      log += Settings.WireClockStretchLimit;
      addLogMove(LOG_LEVEL_INFO, log);
    }
      #if defined(ESP8266)
    Wire.setClockStretchLimit(Settings.WireClockStretchLimit);
      #endif // if defined(ESP8266)
      #ifdef ESP32
    Wire.setTimeOut(Settings.WireClockStretchLimit);
      #endif // ifdef ESP32S2
  }

  #if FEATURE_I2CMULTIPLEXER

  if (validGpio(Settings.I2C_Multiplexer_ResetPin)) { // Initialize Reset pin to High if configured
    pinMode(Settings.I2C_Multiplexer_ResetPin, OUTPUT);
    digitalWrite(Settings.I2C_Multiplexer_ResetPin, HIGH);
  }
  #endif // if FEATURE_I2CMULTIPLEXER

  // I2C Watchdog boot status check
  if (Settings.WDI2CAddress != 0)
  {
    delay(500);
    Wire.beginTransmission(Settings.WDI2CAddress);
    Wire.write(0x83); // command to set pointer
    Wire.write(17);   // pointer value to status uint8_t
    Wire.endTransmission();

    Wire.requestFrom(Settings.WDI2CAddress, (uint8_t)1);

    if (Wire.available())
    {
      uint8_t status = Wire.read();

      if (status & 0x1)
      {
        addLog(LOG_LEVEL_ERROR, F("INIT : Reset by WD!"));
        lastBootCause = BOOT_CAUSE_EXT_WD;
      }
    }
  }
}

void I2CSelectHighClockSpeed() {
  I2CSelectClockSpeed(Settings.I2C_clockSpeed);
}

