ZAG-UA/ESPEasy-mega-20230409-ESP32-C3-S3/src/src/Helpers/Hardware.cpp
#ifdef ESP8266
int lastADCvalue = 0;

int espeasy_analogRead(int pin) {
  if (!WiFiEventData.wifiConnectInProgress) {
    #if FEATURE_ADC_VCC
      lastADCvalue = ESP.getVcc();
    #else
      lastADCvalue = analogRead(A0);
    #endif // if FEATURE_ADC_VCC
  }
  return lastADCvalue;
}

#endif // ifdef ESP8266

#ifdef ESP32

// ESP32 ADC calibration datatypes.
esp_adc_cal_value_t adc1_calibration_type = ESP_ADC_CAL_VAL_NOT_SUPPORTED;
esp_adc_cal_characteristics_t adc_chars[ADC_ATTEN_MAX];

void initADC() {
  # ifndef DEFAULT_VREF
  #  define DEFAULT_VREF 1100
  # endif // ifndef DEFAULT_VREF
  const adc_bits_width_t adc_bit_width = static_cast<adc_bits_width_t>(ADC_WIDTH_MAX - 1);

  for (size_t atten = 0; atten < ADC_ATTEN_MAX; ++atten) {
    adc1_calibration_type =
      esp_adc_cal_characterize(ADC_UNIT_1, static_cast<adc_atten_t>(atten), adc_bit_width, DEFAULT_VREF, &adc_chars[atten]);
  }
}

bool hasADC_factory_calibration() {
  return esp_adc_cal_check_efuse(adc1_calibration_type) == ESP_OK;
}

const __FlashStringHelper* getADC_factory_calibration_type() {
  switch (adc1_calibration_type) {
    case ESP_ADC_CAL_VAL_EFUSE_VREF:   return F("V_ref in eFuse");
    case ESP_ADC_CAL_VAL_EFUSE_TP:     return F("Two Point values in eFuse");
    case ESP_ADC_CAL_VAL_DEFAULT_VREF: return F("Default reference voltage");
    case ESP_ADC_CAL_VAL_EFUSE_TP_FIT: return F("Two Point values and fitting curve in eFuse");
    case ESP_ADC_CAL_VAL_NOT_SUPPORTED:
      break;
  }
  return F("Unknown");
}

int getADC_num_for_gpio(int pin) {
  int adc, ch, t;

  if (getADC_gpio_info(pin, adc, ch, t)) {
    return adc;
  }
  return -1;
}

int espeasy_analogRead(int pin, bool readAsTouch) {
  int value = 0;
  int adc, ch, t;

  if (getADC_gpio_info(pin, adc, ch, t)) {
    bool canread = false;

    switch (adc) {
      case 0:

        value = (int)(temperatureRead());     //   value = hallRead();
        break;
      case 1:
        canread = true;
        break;
      case 2:

        if (WiFi.getMode() == WIFI_OFF) {
          // See:
          // https://docs.espressif.com/projects/esp-idf/en/latest/esp32/api-reference/peripherals/adc.html#configuration-and-reading-adc
          // ADC2 is shared with WiFi, so don't read ADC2 when WiFi is on.
          canread = true;
        }
        break;
    }

    if (canread) {
     #ifndef CONFIG_IDF_TARGET_ESP32C3

      if (readAsTouch && (t >= 0)) {
        value = touchRead(pin);
      } else {
     #endif // ifndef CONFIG_IDF_TARGET_ESP32C3

        value = analogRead(pin);
     #ifndef CONFIG_IDF_TARGET_ESP32C3
      }
     #endif // ifndef CONFIG_IDF_TARGET_ESP32C3
    }
  }
  return value;
}

#endif // ifdef ESP32


/********************************************************************************************\
   Hardware information
 \*********************************************************************************************/
uint32_t getFlashChipId() {
  // Cache since size does not change
  static uint32_t flashChipId = 0;

  if (flashChipId == 0) {
  #ifdef ESP32
    uint32_t tmp = g_rom_flashchip.device_id;

    for (int i = 0; i < 3; ++i) {
      flashChipId  = flashChipId << 8;
      flashChipId |= (tmp & 0xFF);
      tmp          = tmp >> 8;
    }

    //    esp_flash_read_id(nullptr, &flashChipId);
  #elif defined(ESP8266)
    flashChipId = ESP.getFlashChipId();
  #endif // ifdef ESP32
  }
  return flashChipId;
}

uint32_t getFlashRealSizeInBytes() {
  // Cache since size does not change
  static uint32_t res = 0;

  if (res == 0) {
    #if defined(ESP32)
    res = (1 << ((getFlashChipId() >> 16) & 0xFF));
    #else // if defined(ESP32)
    res = ESP.getFlashChipRealSize(); // ESP.getFlashChipSize();
    #endif // if defined(ESP32)
  }
  return res;
}

#ifdef ESP32
uint32_t getXtalFrequencyMHz() {
  return rtc_clk_xtal_freq_get();
}
#endif // ifdef ESP32

uint32_t getFlashChipSpeed() {
  return ESP.getFlashChipSpeed();
}

const __FlashStringHelper* getFlashChipMode() {
  switch (ESP.getFlashChipMode()) {
    case FM_QIO:     return F("QIO");
    case FM_QOUT:    return F("QOUT");
    case FM_DIO:     return F("DIO");
    case FM_DOUT:    return F("DOUT");
#ifdef ESP32
    case FM_FAST_READ: return F("Fast");
    case FM_SLOW_READ: return F("Slow");
#endif // ifdef ESP32
    case FM_UNKNOWN: break;
  }
  return F("Unknown");
}

bool puyaSupport() {
  bool supported = false;

#ifdef PUYA_SUPPORT

  // New support starting core 2.5.0
  if (PUYA_SUPPORT) { supported = true; }
#endif // ifdef PUYA_SUPPORT
#ifdef PUYASUPPORT

  // Old patch
  supported = true;
#endif // ifdef PUYASUPPORT
  return supported;
}

uint8_t getFlashChipVendorId() {
#ifdef PUYA_SUPPORT
  return ESP.getFlashChipVendorId();
#else // ifdef PUYA_SUPPORT
  # if defined(ESP8266)

  // Cache since size does not change
  static uint32_t flashChipId = ESP.getFlashChipId();
  return flashChipId & 0x000000ff;
  # elif defined(ESP32)
  return 0xFF; // Not an existing function for ESP32
  # endif // if defined(ESP8266)
#endif // ifdef PUYA_SUPPORT
}

bool flashChipVendorPuya() {
  const uint8_t vendorId = getFlashChipVendorId();

  return vendorId == 0x85; // 0x146085 PUYA
}

uint32_t getChipId() {
  uint32_t chipId = 0;

#ifdef ESP8266
  chipId = ESP.getChipId();
#endif // ifdef ESP8266
#ifdef ESP32

  for (int i = 0; i < 17; i = i + 8) {
    chipId |= ((ESP.getEfuseMac() >> (40 - i)) & 0xff) << i;
  }
#endif // ifdef ESP32

  return chipId;
}

uint8_t getChipCores() {
  #ifdef ESP8266
  return 1;
  #else // ifdef ESP8266
  static uint8_t cores = 0;

  if (cores == 0) {
    esp_chip_info_t chip_info;
    esp_chip_info(&chip_info);
    cores = chip_info.cores;
  }
  return cores;
  #endif // ifdef ESP8266
}

const __FlashStringHelper* getChipModel() {
#ifdef ESP32

  // https://www.espressif.com/en/products/socs
  // https://github.com/arendst/Tasmota/blob/1e6b78a957be538cf494f0e2dc49060d1cb0fe8b/tasmota/support_esp.ino#L579

  /*
     Source: esp-idf esp_system.h and esptool
     typedef enum {
      CHIP_ESP32   = 1,  //!< ESP32
      CHIP_ESP32S2 = 2,  //!< ESP32-S2
      CHIP_ESP32S3 = 4,  //!< ESP32-S3
      CHIP_ESP32C3 = 5,  //!< ESP32-C3
     } esp_chip_model_t;
     // Chip feature flags, used in esp_chip_info_t
   #define CHIP_FEATURE_EMB_FLASH      BIT(0)      //!< Chip has embedded flash memory
   #define CHIP_FEATURE_WIFI_BGN       BIT(1)      //!< Chip has 2.4GHz WiFi
   #define CHIP_FEATURE_BLE            BIT(4)      //!< Chip has Bluetooth LE
   #define CHIP_FEATURE_BT             BIT(5)      //!< Chip has Bluetooth Classic
     // The structure represents information about the chip
     typedef struct {
      esp_chip_model_t model;  //!< chip model, one of esp_chip_model_t
      uint32_t features;       //!< bit mask of CHIP_FEATURE_x feature flags
      uint8_t cores;           //!< number of CPU cores
      uint8_t revision;        //!< chip revision number
     } esp_chip_info_t;
   */
  esp_chip_info_t chip_info;
  esp_chip_info(&chip_info);

  uint32_t chip_model    = chip_info.model;
  uint32_t chip_revision = chip_info.revision;

  //  uint32_t chip_revision = ESP.getChipRevision();
  bool rev3 = (3 == chip_revision);

  //  bool single_core = (1 == ESP.getChipCores());
  bool single_core = (1 == chip_info.cores);

  if (chip_model < 2) { // ESP32
# if CONFIG_IDF_TARGET_ESP32

    /* esptool:
        def get_pkg_version(self):
            word3 = self.read_efuse(3)
            pkg_version = (word3 >> 9) & 0x07
            pkg_version += ((word3 >> 2) & 0x1) << 3
            return pkg_version
     */
    uint32_t chip_ver    = REG_GET_FIELD(EFUSE_BLK0_RDATA3_REG, EFUSE_RD_CHIP_VER_PKG);
    uint32_t pkg_version = chip_ver & 0x7;

    //    AddLog(LOG_LEVEL_DEBUG_MORE, PSTR("HDW: ESP32 Model %d, Revision %d, Core %d, Package %d"), chip_info.model, chip_revision,
    // chip_info.cores, chip_ver);

    switch (pkg_version) {
      case EFUSE_RD_CHIP_VER_PKG_ESP32D0WDQ6:

