ZAG-UA/ESPEasy-mega-20230409-ESP32-C3-S3/src/src/Helpers/Hardware.cpp
  if ((gpio == 37) || (gpio == 38)) {
    // Pins are not present on the ESP32
    input  = true;
    output = false;
  }

  if ((gpio >= 6) && (gpio <= 11)) {
    // Connected to the integrated SPI flash.
    input   = false;
    output  = false;
    warning = true;
  }

  if ((input == false) && (output == false)) {
    return false;
  }

  // GPIO 0 & 2 can't be used as an input. State during boot is dependent on boot mode.
  warning = (gpio == 0 || gpio == 2);

  if (gpio == 12) {
    // If driven High, flash voltage (VDD_SDIO) is 1.8V not default 3.3V.
    // Has internal pull-down, so unconnected = Low = 3.3V.
    // May prevent flashing and/or booting if 3.3V flash is used and this pin is
    // pulled high, causing the flash to brownout.
    // See the ESP32 datasheet for more details.
    warning = true;
  }

  if (gpio == 15) {
    // If driven Low, silences boot messages printed by the ROM bootloader.
    // Has an internal pull-up, so unconnected = High = normal output.
    warning = true;
  }

  #  if FEATURE_ETHERNET

  // Check pins used for RMII Ethernet PHY
  if (NetworkMedium_t::Ethernet == Settings.NetworkMedium) {
    switch (gpio) {
      case 0:
      case 21:
      case 19:
      case 22:
      case 25:
      case 26:
      case 27:
        warning = true;
        break;
    }


    // FIXME TD-er: Must we also check for pins used for MDC/MDIO and Eth PHY power?
  }


  #  endif // if FEATURE_ETHERNET

# endif    // ifdef ESP32S2

  if (FoundPSRAM()) {
    // PSRAM can use GPIO 16 and 17
    // There will be a high frequency signal on those pins (flash frequency)
    // which makes them unusable for other purposes.
    // WROVER does not even have these pins made available on the outside.
    switch (gpio) {
      case 16:
      case 17:
        warning = true;
        break;
    }
  }
  return true;
}

bool getGpioPullResistor(int gpio, bool& _hasPullUp, bool& _hasPullDown) {
  _hasPullDown = false;
  _hasPullUp   = false;

  int pinnr;
  bool input;
  bool output;
  bool warning;

  if (!getGpioInfo(gpio, pinnr, input, output, warning)) {
    return false;
  }

#ifdef CONFIG_IDF_TARGET_ESP32S2

  if (gpio <= 45) {
    _hasPullUp   = true;
    _hasPullDown = true;
  }

#elif defined(CONFIG_IDF_TARGET_ESP32C3) // ifdef ESP32S2

  if ((gpio > 10) && (gpio < 18)) {
    // For GPIO 11 - 17, no pull-up nor pull-down.
  } else if (gpio == 2 || gpio == 8 || gpio == 9) {
    // No Pull-down on GPIO2,8,9
    // Just connect GPIO2,8,9 to VDD via a 10 kOhm resistor.
  } else if (gpio <= 21) {
    _hasPullUp   = true;
    _hasPullDown = true;
  }

#elif defined(CONFIG_IDF_TARGET_ESP32S3)

  if (gpio <= 48) {
    _hasPullUp   = true;
    _hasPullDown = true;
  }

#else // ifdef CONFIG_IDF_TARGET_ESP32S2

  // ESP32 classic
  if (gpio >= 34) {
    // For GPIO 34 .. 39, no pull-up nor pull-down.
  } else if (gpio == 12) {
    // No Pull-up on GPIO12
    // compatible with the SDIO protocol.
    // Just connect GPIO12 to VDD via a 10 kOhm resistor.
  } else {
    _hasPullUp   = true;
    _hasPullDown = true;
  }

#endif // ifdef CONFIG_IDF_TARGET_ESP32S2
  return true;
}

#endif // ifdef ESP32

#ifdef ESP8266

// return true when pin can be used.
bool getGpioInfo(int gpio, int& pinnr, bool& input, bool& output, bool& warning) {
  pinnr  = -1;
  input  = true;
  output = true;

  // GPIO 0, 2 & 15 can't be used as an input. State during boot is dependent on boot mode.
  warning = (gpio == 0 || gpio == 2 || gpio == 15);

  switch (gpio) {
    case  0: pinnr =  3; break;
    case  1: pinnr = 10; break;
    case  2: pinnr =  4; break;
    case  3: pinnr =  9; break;
    case  4: pinnr =  2; break;
    case  5: pinnr =  1; break;
    case  6:                    // GPIO 6 .. 8  is used for flash
    case  7:
    case  8: pinnr = -1; break;
    case  9: pinnr = 11; break; // On ESP8266 used for flash
    case 10: pinnr = 12; break; // On ESP8266 used for flash
    case 11: pinnr = -1; break;
    case 12: pinnr =  6; break;
    case 13: pinnr =  7; break;
    case 14: pinnr =  5; break;

    // GPIO-15 Can't be used as an input. There is an external pull-down on this pin.
    case 15: pinnr =  8; input = false; break;
    case 16: pinnr =  0; break; // This is used by the deep-sleep mechanism
  }

  if (isFlashInterfacePin(gpio)) {
    if (isESP8285()) {
      if ((gpio == 9) || (gpio == 10)) {
        // Usable on ESP8285
      } else {
        warning = true;
      }
    } else {
      warning = true;

      // On ESP8266 GPIO 9 & 10 are only usable if not connected to flash
      if (gpio == 9) {
        // GPIO9 is internally used to control the flash memory.
        input  = false;
        output = false;
      } else if (gpio == 10) {
        // GPIO10 can be used as input only.
        output = false;
      }
    }
  }

  if ((pinnr < 0) || (pinnr > 16)) {
    input  = false;
    output = false;
  }
  return input || output;
}

bool getGpioPullResistor(int gpio, bool& _hasPullUp, bool& _hasPullDown) {
  _hasPullDown = false;
  _hasPullUp   = false;

  if (!validGpio(gpio)) {
    return false;
  }

  if (gpio == 16) {
    _hasPullDown = true;
  } else {
    _hasPullUp = true;
  }
  return true;
}

#endif // ifdef ESP8266

bool validGpio(int gpio) {
  if ((gpio < 0) || (gpio > MAX_GPIO)) {
    return false;
  }

  int pinnr;
  bool input;
  bool output;
  bool warning;

  return getGpioInfo(gpio, pinnr, input, output, warning);
}

#ifdef ESP32

// Get ADC related info for a given GPIO pin
// @param gpio_pin   GPIO pin number
// @param adc        Number of ADC unit (0 == Hall effect)
// @param ch         Channel number on ADC unit
// @param t          index of touch pad ID
bool getADC_gpio_info(int gpio_pin, int& adc, int& ch, int& t)
{
  adc = -1;
  ch  = -1;
  t   = -1;

#if defined(CONFIG_IDF_TARGET_ESP32S2) || defined(CONFIG_IDF_TARGET_ESP32S3)

  switch (gpio_pin) {
    case -1: adc = 0; break; // Temperature Sensor
    case 1:  adc = 1; ch = 0; t = 1; break;
    case 2:  adc = 1; ch = 1; t = 2; break;
    case 3:  adc = 1; ch = 2; t = 3; break;
    case 4:  adc = 1; ch = 3; t = 4; break;
    case 5:  adc = 1; ch = 4; t = 5; break;
    case 6:  adc = 1; ch = 5; t = 6; break;
    case 7:  adc = 1; ch = 6; t = 7; break;
    case 8:  adc = 1; ch = 7; t = 8; break;
    case 9:  adc = 1; ch = 8; t = 9; break;
    case 10: adc = 1; ch = 9; t = 10; break;
    case 11: adc = 2; ch = 0; t = 11; break;
    case 12: adc = 2; ch = 1; t = 12; break;
    case 13: adc = 2; ch = 2; t = 13; break;
    case 14: adc = 2; ch = 3; t = 14; break;
    case 15: adc = 2; ch = 4;  break;
    case 16: adc = 2; ch = 5;  break;
    case 17: adc = 2; ch = 6;  break;
    case 18: adc = 2; ch = 7;  break;
    case 19: adc = 2; ch = 8;  break;
    case 20: adc = 2; ch = 9;  break;
    default:
      return false;
  }

#elif defined(CONFIG_IDF_TARGET_ESP32C3) // if defined(CONFIG_IDF_TARGET_ESP32S2) || defined(CONFIG_IDF_TARGET_ESP32S3)

  switch (gpio_pin) {
    case -1: adc = 0; break; // Temperature Sensor
    case 1:  adc = 1; ch = 0;  break;
    case 2:  adc = 1; ch = 1;  break;
    case 3:  adc = 1; ch = 2;  break;
    case 4:  adc = 1; ch = 3;  break;
    case 5:  adc = 1; ch = 4;  break;
    case 6:  adc = 2; ch = 0;  break;
    default:
      return false;
  }


#else // if defined(CONFIG_IDF_TARGET_ESP32S2) || defined(CONFIG_IDF_TARGET_ESP32S3)

  // Classic ESP32
  switch (gpio_pin) {
    case -1: adc = 0; break; // Temperature Sensor ; // Hall effect Sensor
    case 36: adc = 1; ch = 0; break;
    case 37: adc = 1; ch = 1; break;
    case 38: adc = 1; ch = 2; break;
    case 39: adc = 1; ch = 3; break;
    case 32: adc = 1; ch = 4; t = 9; break;
    case 33: adc = 1; ch = 5; t = 8; break;
    case 34: adc = 1; ch = 6; break;
    case 35: adc = 1; ch = 7; break;
    case 4:  adc = 2; ch = 0; t = 0; break;
    case 0:  adc = 2; ch = 1; t = 1; break;
    case 2:  adc = 2; ch = 2; t = 2; break;
    case 15: adc = 2; ch = 3; t = 3; break;
    case 13: adc = 2; ch = 4; t = 4; break;
    case 12: adc = 2; ch = 5; t = 5; break;
    case 14: adc = 2; ch = 6; t = 6; break;
    case 27: adc = 2; ch = 7; t = 7; break;
    case 25: adc = 2; ch = 8; break;
    case 26: adc = 2; ch = 9; break;
    default:
      return false;
  }
#endif // if defined(CONFIG_IDF_TARGET_ESP32S2) || defined(CONFIG_IDF_TARGET_ESP32S3)
  return true;
}

