ZAG-UA/ESPEasy-mega-20230409-ESP32-C3-S3/src/src/Helpers/Hardware.cpp
int touchPinToGpio(int touch_pin)
{
#ifndef CONFIG_IDF_TARGET_ESP32C3

#if defined(CONFIG_IDF_TARGET_ESP32S2) || defined(CONFIG_IDF_TARGET_ESP32S3)

  switch (touch_pin) {
    case 1: return T1;
    case 2: return T2;
    case 3: return T3;
    case 4: return T4;
    case 5: return T5;
    case 6: return T6;
    case 7: return T7;
    case 8: return T8;
    case 9: return T9;
    case 10: return T10;
    case 11: return T11;
    case 12: return T12;
    case 13: return T13;
    case 14: return T14;
    default:
      break;
  }

#else // if defined(CONFIG_IDF_TARGET_ESP32S2) || defined(CONFIG_IDF_TARGET_ESP32S3)

  // ESP32 classic
  switch (touch_pin) {
    case 0: return T0;
    case 1: return T1;
    case 2: return T2;
    case 3: return T3;
    case 4: return T4;
    case 5: return T5;
    case 6: return T6;
    case 7: return T7;
    case 8: return T8;
    case 9: return T9;
    default:
      break;
  }

#endif // if defined(CONFIG_IDF_TARGET_ESP32S2) || defined(CONFIG_IDF_TARGET_ESP32S3)

#endif // ifndef CONFIG_IDF_TARGET_ESP32C3

  return -1;
}

#endif // ifdef ESP32

// ********************************************************************************
// Manage PWM state of GPIO pins.
// ********************************************************************************
void initAnalogWrite()
{

#ifdef ESP32

  for (uint8_t x = 0; x < LED_CHANNELS; x++) {
    ledChannelPin[x]  = -1;
    ledChannelFreq[x] = ledcSetup(x, 1000, 10); // Clear the channel
  }
#endif // ifdef ESP32
#ifdef ESP8266

  // See https://github.com/esp8266/Arduino/commit/a67986915512c5304bd7c161cf0d9c65f66e0892
  analogWriteRange(1023);
  #endif // ifdef ESP8266

}

#if defined(ESP32)

int8_t ledChannelPin[LED_CHANNELS];
uint32_t ledChannelFreq[LED_CHANNELS] = { 0 };

  static bool initialized = false;

int8_t attachLedChannel(int pin, uint32_t frequency)
{
  if (!initialized) {
    for (uint8_t x = 0; x < LED_CHANNELS; x++) {
      ledChannelPin[x]  = -1;
      ledChannelFreq[x] = 0;
    }
    initialized = true;
  }


  // find existing channel if this pin has been used before
  int8_t ledChannel = -1;
  bool mustSetup    = false;

  for (uint8_t x = 0; x < LED_CHANNELS; x++) {
    if (ledChannelPin[x] == pin) {
      ledChannel = x;
    }
  }

  if (ledChannel == -1)                                    // no channel set for this pin
  {
    for (uint8_t x = 0; x < LED_CHANNELS && ledChannel == -1; x++) { // find free channel
      if (ledChannelPin[x] == -1)
      {
        if (static_cast<uint32_t>(ledcReadFreq(x)) == ledChannelFreq[x]) {
          // Channel is not used by some other piece of code.
          ledChannel = x;
          mustSetup  = true;
          break;
        }
      }
    }
  }

  if (ledChannel == -1) { return ledChannel; }

  if (frequency != 0) {
    if (ledChannelFreq[ledChannel] != frequency)
    {
      // Frequency is given and has changed
      mustSetup = true;
    }
    ledChannelFreq[ledChannel] = frequency;
  } else if (ledChannelFreq[ledChannel] == 0) {
    mustSetup = true;

    // Set some default frequency
    ledChannelFreq[ledChannel] = 1000;
  }

  if (mustSetup) {
    // setup channel to 10 bit and set frequency.
    ledChannelFreq[ledChannel] = ledcSetup(ledChannel, ledChannelFreq[ledChannel], 10);
    ledChannelPin[ledChannel]  = pin; // store pin nr
    ledcAttachPin(pin, ledChannel);   // attach to this pin
    //    pinMode(pin, OUTPUT);
  }

  return ledChannel;
}

void detachLedChannel(int pin)
{
  int8_t ledChannel = -1;

  for (uint8_t x = 0; x < LED_CHANNELS; x++) {
    if (ledChannelPin[x] == pin) {
      ledChannel = x;
    }
  }

  if (ledChannel != -1) {
    ledcWrite(ledChannel, 0);
    ledcDetachPin(pin);
    ledChannelPin[ledChannel]  = -1;
    ledChannelFreq[ledChannel] = 0;
  }
}

uint32_t analogWriteESP32(int pin, int value, uint32_t frequency)
{
  // For now, we only support the internal GPIO pins.

  if (!checkValidPortRange(PLUGIN_GPIO, pin)) {
    return 0;
  }

  if (value == 0) {
    detachLedChannel(pin);
    return 0;
  }

  // find existing channel if this pin has been used before
  int8_t ledChannel = attachLedChannel(pin, frequency);

  if (ledChannel != -1) {
    ledcWrite(ledChannel, value);
    return ledChannelFreq[ledChannel];
  }
  return 0;
}

#endif // if defined(ESP32)

bool set_Gpio_PWM_pct(int gpio, float dutyCycle_f, uint32_t frequency) {
  uint32_t dutyCycle = dutyCycle_f * 10.23f;

  return set_Gpio_PWM(gpio, dutyCycle, frequency);
}

bool set_Gpio_PWM(int gpio, uint32_t dutyCycle, uint32_t frequency) {
  uint32_t key;

  return set_Gpio_PWM(gpio, dutyCycle, 0, frequency, key);
}

bool set_Gpio_PWM(int gpio, uint32_t dutyCycle, uint32_t fadeDuration_ms, uint32_t& frequency, uint32_t& key)
{
  // For now, we only support the internal GPIO pins.

  if (!checkValidPortRange(PLUGIN_GPIO, gpio)) {
    return false;
  }

  portStatusStruct tempStatus;

  // FIXME TD-er: PWM values cannot be stored very well in the portStatusStruct.
  key = createKey(PLUGIN_GPIO, gpio);

  // WARNING: operator [] creates an entry in the map if key does not exist
  // So the next command should be part of each command:
  tempStatus = globalMapPortStatus[key];

#if defined(ESP8266)
  pinMode(gpio, OUTPUT);
  if ((frequency > 0) && (frequency <= 40000)) {
    analogWriteFreq(frequency);
  }
#endif // if defined(ESP8266)

  if (fadeDuration_ms != 0)
  {
    const int32_t resolution_factor = (1 << 12);
    const uint8_t prev_mode         = tempStatus.mode;
    int32_t   prev_value            = tempStatus.getDutyCycle();

    // getPinState(PLUGIN_GPIO, gpio, &prev_mode, &prev_value);
    if (prev_mode != PIN_MODE_PWM) {
      prev_value = 0;
    }

    const int32_t step_value = ((static_cast<int32_t>(dutyCycle) - prev_value) * resolution_factor) / static_cast<int32_t>(fadeDuration_ms);
    int32_t curr_value       = prev_value * resolution_factor;

    int i = fadeDuration_ms;

    while (i--) {
      curr_value += step_value;
      const int16_t new_value = curr_value / resolution_factor;
            #if defined(ESP8266)
      analogWrite(gpio, new_value);
            #endif // if defined(ESP8266)
            #if defined(ESP32)
      frequency = analogWriteESP32(gpio, new_value, frequency);
            #endif // if defined(ESP32)
      delay(1);
    }
  }

